import { Component } from '@angular/core';

@Component({
  selector: 'app-places',
  templateUrl: './places.component.html',
  styleUrls: ['./places.component.scss']
})
export class PlacesComponent {
  cities: any[] =
    [
      {
        "id":"cairo",
        "title": "القاهرة",
        "image": "assets/images/cairo-tower.jpg",
        "desc":"القاهرة، أكبر مدينة عربية من حيث عدد السُكّان، هي مدينة يبلغ عدد سُكّانها 21,300.000 نسمة وهي الوجهة التي لطالما قصدها زوّارٌ كُثر، ففيها الحدائق البديعة والأماكن الترفيهية المُتنوّعة، جنباً إلى جنب مع الأسواق التقليدية المميزة، كما أنها تشتهر بأجوائها الشعبية وحياتها الليلية حيث المقاهي والكورنيش الذي يعج بالزوار القادمين للاستمتاع بمشاهدة النيل في المساء."
      },
      {
        "id":"alexandria",
        "title": "الاسكندريه",
        "image": "assets/images/alexandria-hotels.jpg",
        "desc":"تبرز الاسكندرية الواقعة على ساحل البحر المتوسط شمال غرب دلتا النيل والبالغ عدد سُكّانها 4,400.000 نسمة كثاني أكبر مدينة في مصر من حيث عدد السُكّان و كأحد أهم اماكن السياحة في مصر والفضل في ذلك يعود للتنوّع المُذهل الذي تُوفّره من خلال المعالم السياحية والحدائق البديعة والأماكن الترفيهية المُتنوّعة والشواطئ الخلّابة، جنباً إلى جنب مع الأسواق التقليدية المميزة."
      },
      {
        "id":"aswan",
        "title": "اسوان",
        "image": "assets/images/aswan.webp",
        "desc":"تعتبر أسوان من إحدى محافظات مصر المليئة بالأماكن السياحية والتاريخية والأثرية فمُيزت عبر التاريخ بأنها إحدى أهم المدن الشهيرة بالأماكن العلاجية التي يأتي إليها الزوار من كل أنحاء العالم، لكي يستشفوا من أمراضهم."
      }
  ]
}
